Repository: 84000/data-translation-memory
Catalog: toh163-v2.tmx
Source language: bo
Languages: en

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ལིཙྪ་བཱི་གཞོན་ནུ་རིན་ཆེན་དྲ་བ་ཅན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One answered the Licchavi boy Ratnajālin,

source: གཞོན་ནུ་ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, excellent, young man.

source: གང་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ། དོན་འདི་འདྲི་བར་སེམས་པ་ནི་སྤོབས་པ་ལེགས་ཤིང་དཔྱོད་པ་བཟང་ངོ་། །
en: Your thought to ask the Thus-Gone One about such subjects reflects excellent eloquence and fine analysis.

source: དེའི་ཕྱིར་གཞོན་ནུ་ཁྱོད་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་དོ། །
en: Thus, listen well, young man, and bear what I say in mind. Then I will teach you.”

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་འཚལ་ལོ་ཞེས་གསོལ་ཏེ།
en: “Blessed One, I shall do just that.”

source: བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་དྲ་བ་ཅན་སེམས་རྩེ་གཅིག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The bodhisattva Ratnajālin listened as the Blessed One had instructed, and so the Blessed One said,

source: གཞོན་ནུ་འདི་ནས་ཤར་ཕྱོགས་ལོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་མུ་ཏིག་ཅན་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: “Young man, to the east of here there is a world called Pearled.

source: གཞོན་ནུ་འདི་ལྟ་སྟེ།
en: Young man, consider this:

source: སྲིད་པའི་རྩེ་མོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གྱུར་ལ།
en: There are as many peaks of existence as there are grains of sand in the Ganges.

source: དེ་དག་ཐམས་ཅད་ཀྱང་རྡུལ་ཕྲ་མོའི་རྡུལ་སྙེད་ཀྱིས་ཡོངས་སུ་གང་བར་གྱུར་ཅིང་།
en: And all those too are filled with the smallest possible particles.

source: དེ་ནས་སྐྱེས་བུ་འགའ་ཞིག་བྱུང་བས་དེ་དག་ལ་རྡུལ་ཕྲ་མོའི་རྡུལ་ཅིག་ཁྱེར་ཏེ
en: If a person then came along and carried away one single such particle and

source: ཇི་ཙམ་དུ་འཇིག་རྟེན་གྱི་ཁམས་སྲིད་པའི་རྩེ་མོའི་མཐས་གཏུགས་པ་དེ་དག་རྡུལ་ཕྲ་མོའི་རྡུལ་གྱིས་ཡོངས་སུ་གང་བ་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་འདས་ནས་རྡུལ་ཕྲ་མོའི་རྡུལ་གཅིག་འཇོག་ན
en: placed it in a spot past as many trillions of buddha realms as there are smallest particles in all those world systems under the peaks of existence—

source: གཞོན་ནུ་རྣམ་གྲངས་དེ་དང་གྲངས་དེའི་གཞིས་ཡུན་རིང་པོ་འདས་པས་རྡུལ་ཕྲ་མོའི་རྡུལ་གྱི་ཕུང་པོ་ཆེན་པོའི་མཐའ་དེ་དག་ཟད་པའམ། གཏུགས་པར་འགྱུར་རམ།
en: then, young man, by repeating this in the same way for a long time, would that great mass of particles eventually run out and reach its limit?

source: གཞོན་ནུ་དེ་ཅི་སྙམ་དུ་སེམས། འཇིག་རྟེན་གྱི་ཁམས་གང་དུ་སྐྱེས་བུ་དེས་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་དེ་དག་བཞག་པའམ་མ་བཞག་པ་དེ་དག་བསམ་པའམ། བགྲང་བའམ། གཞལ་བའམ། ཉེ་བར་བརྟག་པར་སླའམ།
en: Now, young man, tell me, would it be easy to consider, count, assess, or determine the places in the universe where that person placed or did not place those particles?”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་ཏེ།
en: “Blessed One, it would not be easy.

source: བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་གང་ཞིག་དཔེ་འདི་བཤད་པ་ལ་ཡང་དག་པའི་འདུ་ཤེས་བསྐྱེད་པར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ནི་ཤེས་པའི་ཕུང་པོ་མཆོག་དང་ལྡན་པར་འགྱུར་བ་ལགས་སོ། །
en: Blessed One, for that reason, anyone who gets the right sense of this analogy that you have expressed would gain a great degree of understanding.”

source: གཞོན་ནུ་འཇིག་རྟེན་གྱི་ཁམས་གང་དུ་སྐྱེས་བུ་དེས་རྡུལ་ཕྲ་མོའི་རྡུལ་དེ་དག་བཞག་གམ། འོན་ཏེ་མ་བཞག་པའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཐམས་ཅད་ཀྱི་འོག་གི་ཆུའི་ཕུང་པོ་ནས་བཟུང་ནས། སྲིད་པའི་རྩེ་མོ་ལ་ཐུག་གི་བར་གྱི་རྡུལ་ཕྲ་མོའི་རྡུལ་རྣམས་ཀྱིས་ཡོངས་སུ་གང་བར་གྱུར་ལ།
en: The Blessed One said, “Young man, if all the worlds in which that person placed a particle, or alternatively the worlds in which that person did not place a particle— ranging from the mass of water underlying these worlds up to their peaks—were filled with minute particles, and

source: སྐྱེས་བུ་གཉིས་པ་ཞིག་བྱུང་བས་དེ་དག་ལས་རྡུལ་ཕྲ་མོའི་རྡུལ་གཅིག་ཁྱེར་ཏེཇི་ཙམ་དུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་གི་རྡུལ་ཕྲ་མོའི་རྡུལ་དེ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་འདས་ནས་རྡུལ་ཕྲ་མོའི་རྡུལ་གཅིག་འཇོག་ན།
en: if a second person came along and removed a single particle from them at a time and placed it in a spot past as many trillions of buddha realms as there were minute particles in those worlds, then,

source: གཞོན་ནུ་རྣམ་གྲངས་དེས་ན་ཡུན་རིང་པོ་འདས་པས་རྡུལ་ཕྲ་མོའི་རྡུལ་བསགས་པའི་ཕུང་པོ་ཆེན་པོ་དེ་འདོར་བར་འགྱུར་རོ། །
en: young man, by repeating this for a long time, eventually that great mass of particles would become dispersed.

source: གཞོན་ནུ་རྣམ་གྲངས་དེས་ན་སྐྱེས་བུ་ཕྱི་མ་དེས་གྲངས་མེད་པ་བརྒྱ་སྟོང་དགུ་བཅུ་རྩ་དགུར་བསྒྱུར་བ་འདས་ནས་
en: Young man, by this way of proceeding, the latter person would travel past nine million nine hundred thousand incalculable numbers of worlds and

source: སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མུ་ཏིག་ཅན་ནོ། །
en: thus arrive past countless trillions of buddha realms. “That is where the world called Pearled is located.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འོད་ཟེར་ཟླ་བས་བརྒྱན་པ་མཁས་པའི་གཟི་བརྗིད་དབྱངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ། །
en: There the thus-gone one, the worthy one, the perfect Buddha Majestic King with the Splendorous Voice of Learning Adorned by Precious Moonlight lives, abides, and teaches the Dharma.

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་གནས་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འོད་ཟེར་ཟླ་བས་བརྒྱན་པ་མཁས་པའི་གཟི་བརྗིད་དབྱངས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་དེའི་མཚན་ལ་སོམ་ཉི་མི་ཟ་ཞིང་
en: Young man, those noble sons or daughters who abide in the Bodhisattva Vehicle, who have no doubt regarding the name of the thus-gone, worthy, perfect Buddha Majestic King with the Splendorous Voice of Learning Adorned by Precious Moonlight, and

source: ངས་མཐོང་བ་ལ་ཡང་ཡིད་ཆེས་ན་དེའི་ཚེ་འདས་པའི་འོག་ཏུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་འཐོབ་པར་འགྱུར་རོ། །
en: who trust in my vision, will attain the dominion of a universal monarch after their lives are over.

source: དེའི་རྒྱལ་སྲིད་ལ་ཡང་སངས་རྒྱས་འབྱུང་བར་འགྱུར་ཞིང་
en: A buddha will appear within their dominions.

source: དེ་བཞིན་གཤེགས་པ་དེ་མཐོང་ནས་ཀྱང་མཆོད་པ་དཔག་ཏུ་མེད་པ་བྱེད་པར་འགྱུར།
en: When they see that thus-gone one, they will perform boundless veneration,

source: ཚངས་པར་སྤྱོད་པར་ཡང་འགྱུར།
en: [When they see that thus-gone one,] they will [perform boundless veneration,] practice pure conduct, and

source: མངོན་པར་ཤེས་པ་ལྔ་ཡང་རྟོགས་པར་ཁོང་དུ་ཆུད་པར་འགྱུར།
en: [When they see that thus-gone one,] they will [perform boundless veneration,] master the five types of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་མཐོང་མ་ཐག་ཏུ་གཟུངས་བརྒྱ་འཁྱིལ་བ་ཞེས་བྱ་བ་འཐོབ་པར་འགྱུར།
en: Immediately upon beholding that thus-gone one, they will achieve the hundred-swirled dhāraṇī.

source: གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་དག་ལ་བསྙེན་བཀུར་བྱེད་པར་འགྱུར།
en: They will serve as many buddhas as there are grains of sand in the Ganges.

source: དེ་སྙེད་ཀྱི་བསྐལ་པ་བྱེ་བ་ཉིད་དུ་འཁོར་བ་ལས་ཕྱིར་ཕྱོགས་པར་བྱེད་པར་འགྱུར།
en: They will turn away from saṃsāra for an equivalent number of eons.

source: དེའི་སེམས་ཤིན་ཏུ་རྨོངས་པ་མེད་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འགྱུར།
en: Their minds will be undeluded, and they will fully awaken to unsurpassed and perfect buddhahood.

source: སྲེད་མེད་ཀྱི་བུའི་ལུས་ལྟར་མཁྲེགས་པའི་ལུས་སུ་འགྱུར།
en: Their bodies will become solid like that of Nārāyaṇa.

source: ལུས་དབྱིབས་གཅིག་ལ་སྤི་ཛ་བཞི་པར་འགྱུར།
en: Residing in a single place, they will possess the four necessities.

source: དེའི་ལུས་ཀྱི་མདོག་གསེར་གྱི་ཁ་དོག་འདྲ་བར་འགྱུར།
en: Their bodies will take on golden complexions.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལུས་བརྒྱན་ཅིང་ཚངས་པའི་སྒྲ་དབྱངས་སུ་ཡང་འགྱུར།
en: They will be adorned with the thirty-two major marks of a great being. They will gain the melodious voice of Brahmā .

source: མི་ཁོམ་པ་ཐམས་ཅད་ཀྱང་སྤོང་ཞིང་དལ་བ་ཕུན་སུམ་ཚོགས་པ་ཡང་འཐོབ་པར་འགྱུར་རོ། །
en: They will eliminate all unfree states and attain an abundance of leisure.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་རྒྱས་པར་བསྟན་པའི་ཕྱིར་ཚིགས་སུ་བཅད་པས་བཀའ་སྩལ་པ།
en: In order to elaborate on the meaning of what he had taught, the Blessed One then spoke in verse:

source: གང་ཞིག་འཇིག་རྟེན་མགོན་པོའི་མཚན། །ཐོས་ནས་སོམ་ཉི་མི་ཟ་ཞིང་། །ངས་མཐོང་བ་ལའང་ཡིད་ཆེས་པ། །དེ་ནི་ཡོན་གནས་འོས་པ་ཡིན། །
en: “Those who hear the name of this world protector And entertain no doubt, Trusting in what I see, Shall become worthy of veneration.

source: རྟག་ཏུ་འཁོར་ལོས་སྒྱུར་བ་ཡི། །རྒྱལ་སྲིད་འཐོབ་ཅིང་སངས་རྒྱས་མཐོང་། །
en: “They will attain the eternal dominion Of universal monarchs and behold buddhas.

source: མཐོང་ནས་དཔག་ཏུ་མེད་པ་དང་། །བསམ་གྱིས་མི་ཁྱབ་མཆོད་པ་བྱེད། །
en: Having beheld them, they will perform Boundless and inconceivable veneration.

source: རྟག་ཏུ་ཚངས་པར་སྤྱོད་པ་དང་། །མངོན་པར་ཤེས་རྣམས་རྟོགས་པར་འགྱུར། །
en: “They will always practice pure conduct. They will realize all forms of miraculous abilities.

source: སངས་རྒྱས་མཐོང་ནས་བརྒྱ་འཁྱིལ་བའི། །གཟུངས་ཀྱང་དེ་ཡིས་འཐོབ་པར་འགྱུར། །
en: Once they see the Buddha, they will achieve The hundred-swirled dhāraṇī.

source: ཇི་ལྟར་གང་གཱའི་བྱེ་མ་སྙེད། །དེ་སྙེད་སངས་རྒྱས་མཐོང་བར་འགྱུར། །
en: “They will behold as many buddhas As there are sands in the Ganges.

source: དེ་སྙེད་བསྐལ་པ་བྱེ་བ་རུ། །འཁོར་བ་དག་ནི་སྤངས་པར་འགྱུར། །
en: They will abandon saṃsāra For that many billions of eons.

source: གང་ཞིག་འཇིག་རྟེན་མགོན་པོའི་མཚན། །ཚོགས་དང་དགེ་འདུན་དག་ལ་བརྗོད། །དེ་ཡི་སེམས་ནི་མི་རྨོངས་ཤིང་། །སངས་རྒྱས་བྱང་ཆུབ་རྒྱུ་བྱེད་དོ། །
en: “Those who hear the name of the world protector Spoken to the assemblies and saṅghas Will become undeluded, And it will be a cause for awakening to buddhahood.

source: རྟག་ཏུ་སྲེད་མེད་བུ་འདྲ་ཞིང་། །ལུས་དབྱིབས་གཅིག་ལ་སྤི་ཛ་བཞི། །ལུས་ནི་གསེར་གྱི་མདོག་འདྲ་ཞིང་། །སུམ་ཅུ་རྩ་གཉིས་མཚན་འཆང་འགྱུར། །
en: “They will always be like Nārāyaṇa. Residing in a single place, they will possess the four necessities. Their bodies will be golden colored And display the thirty-two marks.

source: གང་ཞིག་མཚན་ནི་ཐོས་ནས་སུ། །ཡན་ལག་ལྔ་ཡིས་ཕྱག་བྱས་ན། །རྟག་ཏུ་ཚངས་པའི་དབྱངས་ལྡན་ཞིང་། །མི་ཁོམ་པ་ཡང་སྤངས་པར་འགྱུར། །
en: “Those who hear his name And prostrate with their five points Will permanently gain the voice of Brahmā And abandon the unfree states.

source: གང་ཞིག་འཇིག་རྟེན་མགོན་པོའི་མཚན། །ཐོས་ནས་སོམ་ཉི་མི་ཟ་བ། །དེ་ནི་བྱང་ཆུབ་ལ་མི་འགོང་། །དེ་ནི་ནམས་ཀྱང་སོམ་ཉི་མེད། །
en: “Those who hear the name of this world protector And entertain no doubt Will not shy away from awakening. They shall never have any hesitation.

source: གང་ཞིག་ཉིན་དང་མཚན་བདུན་དུ། །ཚང་བར་རྒྱལ་བའི་མཚན་འཛིན་པ། །སངས་རྒྱས་བསྔགས་པ་མཐའ་ཡས་པའི། །མིག་ནི་རྣམ་པར་དག་པར་འགྱུར། །
en: “Those who remember the victor’s name For a full seven days and nights Will purify the infinite seeing eyes Praised by the buddhas.

source: མི་དེ་ཡི་ནི་ཤ་ཡི་མིག །ལྷ་ཡི་མིག་ཏུ་རྣམ་སྦྱོང་སྟེ། །
en: “They shall refine the eyes of flesh Into the eyes of a god.

source: གང་གཱའི་ཀླུང་གི་བྱེ་སྙེད་ཀྱི། །སངས་རྒྱས་མང་པོ་མཐོང་བར་འགྱུར། །
en: They will perceive as many buddhas As there are grains of sand in the Ganges.

source: ཐམས་ཅད་ལ་ནི་མཆོད་བྱེད་ཅིང་། །ཐམས་ཅད་ལས་ནི་ཐོས་པ་འཛིན། །
en: “They will venerate each of them And receive teachings from each as well.

source: མིག་གིས་ཐམས་ཅད་མཐོང་ནས་སུ། །མི་རྣམས་ཐམས་ཅད་དབུགས་འབྱིན་ཏོ། །
en: Seeing all the buddhas with their own eyes, They will bring comfort to all humanity.

source: དེ་བཞིན་གཤེགས་པའི་མཚན་ཐོས་པ། །སྔོན་ཆད་བསམ་གྱིས་མི་ཁྱབ་པའི། །བསྙེན་བཀུར་སངས་རྒྱས་དག་ལ་བྱས། །
en: “Those who hear the name of this thus-gone one Have already offered unfathomable service To the buddhas,

source: དེ་དག་ཐམས་ཅད་རྗེས་དྲན་འགྱུར། །
en: All of whom they will recollect.

source: སྲོག་ཆགས་གང་རྣམས་མདུན་དག་ཏུ། །མཚན་ནི་བསྟན་པར་བྱས་གྱུར་ན། །སེམས་ཅན་གཞན་གྱིས་དེ་མཐོང་ཞིང་། །ངེས་པར་བྱང་ཆུབ་འགྱུར་བ་ཡིན། །
en: “If his name is relayed Before any being at all, When those other beings hear this name, They too will definitely proceed to awakening.

source: སངས་རྒྱས་ལ་ནི་དད་བསྐྱེད་པས། །མི་ཁོམ་ཐམས་ཅད་རྣམ་པར་སྤངས། །
en: “By generating faith in this buddha, The unfree states are dispelled,

source: རྩོད་དང་འགྱེད་པ་བྱས་པས་ནི། །མི་ཁོམ་རྣམས་སུ་སྐྱེ་བར་འགྱུར། །
en: While by engaging in debate and quarreling, One will be born into the unfree states.

source: ཐུབ་པ་ཆེན་པོ་དེ་ཡི་མཚན། །སེམས་ཅན་གཅིག་ཅིག་ཐོས་བྱས་ན། །རྩོད་པ་དང་ནི་འགྱེད་པ་ཡང་། །ཡིད་ལ་བྱེད་པར་མི་འགྱུར་རོ། །
en: “Once beings have heard The name of this great sage, They shall no longer be interested In debate and quarreling.

source: གལ་ཏེ་མནར་མེད་པ་ཡི་ལས། །བསྐལ་པ་གནས་པར་འགྱུར་བ་དག །ཀླད་ནད་ཙམ་ཞིག་བསྐྱེད་ནས་སུ། །ལས་ཀུན་རྣམ་པར་སྨིན་མི་འགྱུར། །
en: “The actions that lead to the Hell of Ultimate Torment, Which could last for eons, As well as the actions that produce a simple headache— All such actions will not ripen for these beings.

source: དེ་ལ་མེས་ནི་མི་ཚིག་ཅིང་། །ཆུ་ཡི་ནང་དུ་འཆི་མི་འགྱུར། །
en: “They shall not be burned by fire, Nor drown in water.

source: དེ་ལ་རྒྱལ་པོ་རབ་ཁྲོས་ཀྱང་། །མྱུར་བ་ཉིད་དུ་ཞི་བར་འགྱུར། །
en: Even when they draw the ire of the king, It shall be quickly assuaged.

source: གང་ཞིག་ཐུབ་པའི་མཚན་འཛིན་པ། །ནམས་ཀྱང་ལོང་བ་ཞར་བ་དང་། །ཐེང་དང་སྒུར་དང་ལུས་ཉམས་དང་། །ནད་ནི་མང་པོར་མི་འགྱུར་རོ། །
en: “Those who remember this sage’s name Shall be spared many illnesses Including blindness, defective sight, Paralysis, hunchback, and decrepitude.

source: གནོད་སྦྱིན་དྲི་ཟ་ཡི་དགས་དང་། །གྲུལ་བུམ་སྲིན་པོ་མི་རྣམས་ནི། །སྡིག་ཅན་མ་རུངས་པ་རྣམས་དག །མི་དེ་ལ་ནི་གནོད་མི་བྱེད། །
en: “Evil and malevolent Yakṣas, gandharvas, asuras, Kumbhāṇḍas, rākṣasas, and humans Shall be unable to harm them.

source: གང་ཞིག་ཐུབ་པའི་མཚན་འཛིན་པ། །འབྱུང་པོ་དྲི་ཟ་གནོད་སྦྱིན་རྣམས། །ཀླུ་དང་ལྷ་རྣམས་ཐམས་ཅད་ཀྱི། །ཡིད་དུ་འོང་ཞིང་དགའ་བར་འགྱུར། །
en: “Those who remember this sage’s name Shall be favored and preferred By all the bhūtas, gandharvas, yakṣas, Nāgas, and gods.

source: འདིར་ནི་སྐྱོབ་པའི་མཚན་ཐོས་པ། །ཤིན་ཏུ་བསགས་པ་དམ་པའི་དབྱངས། །ཏིང་འཛིན་མྱུར་དུ་ཐོབ་པར་འགྱུར། །
en: “Those who hear this protector’s name Shall swiftly attain vast accumulations, Sublime voices, and absorption.

source: ཡོན་ཏན་བྱེ་བ་རབ་ཏུ་སྒྲོགས། །
en: Their myriad virtues will be renowned.

source: གང་ཞིག་འཇིག་རྟེན་མགོན་པོའི་མཚན། །ཐོས་ནས་སོམ་ཉི་མི་ཟ་བ། །ཕྱི་མའི་དུས་ཀྱི་ཚེ་དག་ཏུ། །དེ་ཡི་བྱང་ཆུབ་འདི་འཛིན་ཏོ། །
en: “Having heard this world protector’s name Without doubting it, They will hew to awakening Throughout all their subsequent lives.

source: ཐུབ་པ་ཆེན་པོའི་མཚན་ཐོས་པ། །སངས་རྒྱས་མྱ་ངན་འདས་རྣམས་ཀྱིས། །ལེགས་པར་གསུངས་པའི་ཆོས་ཀྱི་ཚུལ། །འཛིན་ཅིང་ཡང་དག་རབ་ཏུ་སྟོན། །
en: “Those who hear this great sage’s name Shall uphold and preach The way of the well-spoken Dharma Taught by the buddhas who have gone beyond anguish.

source: སངས་རྒྱས་ཀུན་གྱིས་ལེགས་གསུངས་པའི། །ཆོས་དེ་རྣམས་ནི་དེས་འཛིན་ཏོ། །
en: “They shall uphold the teachings Well spoken by all the buddhas.

source: བཀོད་པ་མཆོག་ནི་དེས་བྱེད་ཅིང་། །སངས་རྒྱས་ཀུན་ལ་བསྙེན་བཀུར་བྱེད། །
en: They shall manifest the supreme array And serve all the buddhas.

source: དེ་ནས་འཆི་བའི་དུས་བྱས་ནས། །སངས་རྒྱས་བྱེ་བ་དེས་མྱུར་མཐོང་། །སངས་རྒྱས་རྣམས་ཀྱིས་གསུངས་པ་ཡི། །ཆོས་རྣམས་དེ་དག་འཛིན་པར་བྱེད། །
en: “Once they pass away, They will swiftly behold myriad buddhas And uphold the teachings Spoken by the buddhas.

source: སྐྱོབ་པ་དེ་ཡི་མཚན་ཐོས་པ། །སྲོག་ཆགས་བྱེ་བ་ནན་ཏན་གྱིས། །འདུལ་བར་བྱེད་ཅིང་རབ་ཏུ་འགོད། །ཐམས་ཅད་བྱང་ཆུབ་ཕྱིར་འཇོག་གོ། །
en: “Those who hear this protector’s name Shall earnestly train and establish Millions of beings on the path, Bringing them all to awakening.

source: ང་ཡིས་མཐོང་ལའང་ཡིད་ཆེས་པ། །སྐྱོབ་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི། །རབ་ཏུ་བསྟན་པ་འཛིན་འགྱུར་ཞིང་། །སངས་རྒྱས་རྣམས་ཀྱང་མཆོད་པར་འགྱུར། །
en: “Those who trust what I have seen Shall uphold the teachings Of all the buddhas, the protectors, And additionally venerate the buddhas.

source: སངས་རྒྱས་མཁྱེན་ལ་གང་དད་པ། །ངས་མཐོང་བ་ལའང་དེ་ཡིད་ཆེས། །འཆིང་བ་རྣམས་ལས་དེས་རྣམས་འགྲོལ། །ཀློང་ལས་རྒལ་ཅིང་འཇིགས་པ་མེད། །
en: “Those who have faith in this buddha’s wisdom, Trusting in what I have seen, Shall be liberated from many fetters. They will cross the abyss and become fearless.

source: གང་ཞིག་དམ་པའི་ཆོས་སྤོང་བ། །དེ་ནི་བདུད་ཀྱི་སྡེ་ཡིན་ནོ། །
en: “Whosoever abandons the sublime Dharma Is among Māra ’s ranks.

source: འགྲོ་བ་ལྔ་རུ་འགྲོ་བ་ཡི། །སེམས་ཅན་ཀུན་གྱི་བ་སྤུ་གང་། །དེ་ནི་སྟོན་པའི་པུས་མོ་ཡི། །ལྷ་ང་གཅིག་གིས་བ་སྤུར་སྡུད། །
en: “The body hairs of every being Who migrates among the five types of beings Could be consolidated Within one hair on the teacher’s kneecap.

source: སྐྱོབ་པ་འཇིག་རྟེན་མགོན་པོ་ཡི། །བ་སྤུ་གཅིག་གི་ཁུང་བུ་ནས། །ཇི་ལྟར་གང་གཱའི་བྱེ་མ་སྙེད། །དེ་སྙེད་འོད་ཟེར་འབྱིན་པར་མཛད། །
en: “From a single pore Of the protector, the guardian of the world, As many rays of light as there are Grains of sand in the Ganges stream forth.

source: གང་ཞིག་འཇིག་རྟེན་མགོན་འདི་ཡི། །འོད་ཟེར་མཐའ་ཡས་ལ་ཡིད་ཆེས། །ཚེ་གཅིག་གིས་ནི་སངས་རྒྱས་རྣམས། །སངས་རྒྱས་བྱེ་བ་མཐོང་བར་འགྱུར། །
en: “Those who trust in the infinite light Of the world protector Shall in one life behold many buddhas— Millions of buddhas.

source: ཆོས་ཀྱི་རྒྱལ་པོ་མདོ་སྡེ་འདི། །བཤད་པ་གང་ཞིག་ཐོས་གྱུར་ནས། །ནམས་ཀྱང་ཡིད་གཉིས་མི་ཟ་བ། །དེ་ནི་ང་དང་འདྲ་བར་འགྱུར། །
en: “Those who hear the teaching Of this discourse by the Dharma king And never doubt it Shall become like me.

source: ཡངས་པ་ཅན་དུ་མདོ་སྡེ་འདི། །བཤད་པའི་ཚེ་ན་སུས་ཐོས་པ། །དེ་ནི་ཕྱི་མའི་དུས་སུ་དེས། །གཞན་ལ་ཡང་དག་རབ་ཏུ་སྟོན། །
en: “Those who hear the teaching Of this discourse in Vaiśālī Shall themselves preach it to others At a later time.

source: ཇི་ལྟར་གང་གཱའི་བྱེ་མ་དག །མི་གང་གིས་ནི་མང་བརྗོད་པ། །དེ་སྙེད་འཇིག་རྟེན་ཁམས་རྣམས་སུ། །འོད་ཟེར་གཅིག་གིས་ཁྱབ་པར་བྱེད། །
en: “Those who preach this widely Shall come to pervade as many worlds As there are grains of sand in the Ganges With a single burst of light.

source: སངས་རྒྱས་ཞིང་རྣམས་ཐམས་ཅད་དག །བགྲང་བའི་ཚུལ་གྱིས་མི་མཆོད་པ། །གསེར་རྣམས་ཀྱིས་ནི་བཀང་ནས་སུ། །འཇིག་རྟེན་མགོན་ལ་ཕུལ་བ་བས། །
en: “One may fill with gold All the buddha realms, The numbers of which defy counting, And offer it to the world protectors.

source: འདི་ཡི་མཚན་ནི་ཐོས་ནས་སུ། །དགའ་བ་བཟང་པོ་སྐྱེས་གྱུར་ཏེསངས་རྒྱས་ཕྱག་འཚལ་ཞེས་བརྗོད་པ། །དེ་ཡི་བསོད་ནམས་བསམ་མི་ཁྱབ། །
en: “Yet, in comparison, those who hear this name And who are truly delighted by it And utter their homage to the buddhas Obtain inconceivably more merit.

source: འཇིག་རྟེན་མགོན་ནི་ཐམས་ཅད་ལ། །ཡང་དང་ཡང་དུ་ཕྱག་འཚལ་བ། །དེ་ཡི་བསོད་ནམས་ཕུང་པོ་ནི། །ཚད་ནི་བཤད་པར་མི་ནུས་སོ། །
en: “The mass of merit gained By repeatedly paying homage To all the world protectors Cannot be expressed by any measure.

source: གང་ཞིག་འཇིག་རྟེན་མགོན་པོའི་མཚན། །ཐོས་ནས་སོམ་ཉི་མི་ཟ་བ། །དེ་ཡི་ལུས་ནི་འོད་ཟེར་གྱིས། །ཁྱབ་ཅིང་རིན་པོ་ཆེ་ལྟར་འགྱུར། །
en: “Those who hear the world protector’s name And do not hesitate about it Will have their bodies filled with light And become like precious gems.

source: གང་ཞིག་ཐུབ་པའི་མཚན་འཛིན་པ། །དེ་ནི་རྣམ་པར་འདས་གྱུར་ནས། །ལྷ་ཡི་ཙན་དན་དམར་པོ་ཡི། །དྲི་ཞིམ་ཁ་ནས་རབ་ཏུ་འབྱུང་། །
en: “After they have passed beyond, Those who remember the name of the sage Will have the sweet scent of divine red sandalwood Waft from their mouth.

source: སྐྱོབ་པ་སེམས་ཅན་སྙིང་པོ་ཡི། །སངས་རྒྱས་ཀྱི་ནི་མཚན་ཐོས་པ། །བ་སྤུའི་ཁུང་ནས་འོད་ཟེར་དག །བཀྱེ་བས་ལུས་ཀྱང་མཛེས་པར་འགྱུར། །
en: “Those who hear the name Of the Buddha, the protector, the essential being, Will have light stream from their pores, Beautifying their bodies.

source: ཚེ་རབས་དག་ནི་ཐམས་ཅད་དུ། །ཐོས་པ་མང་པོར་འགྱུར་བ་སྟེ། །ཀུན་དགའ་སངས་རྒྱས་ཅི་འདྲ་བའི། །དཔག་ཏུ་མེད་པའི་ཐོས་པའང་འཛིན། །
en: “In all of their ensuing lives They will become deeply learned. They will retain their unfathomable erudition, Just like Ānanda does for the Buddha.

source: འཇིག་རྟེན་སྣང་བྱེད་དེས་མཐོང་ནས། །གཞལ་གྱིས་མི་ལང་དགའ་བ་འཐོབ། །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པ་ན། །ཚེ་རབས་དག་ནི་དྲན་པར་འགྱུར། །
en: “When they behold the one who illuminates the world, They will attain boundless happiness. As they engage in bodhisattva conduct, They will recall all their lives.

source: རྒྱལ་བའི་ཐུགས་སྲས་མཐོང་ནས་ཀྱང་། །གཞལ་གྱིས་མི་ལང་དགའ་བ་འཐོབ། །
en: “Even when they see the victors’ heart sons, They will attain boundless happiness.

source: སྤོས་དང་མེ་ཏོག་བྱུག་རྣམས་ཀྱིས། །མཆོད་པ་དག་ནི་རྒྱ་ཆེན་བྱེད། །
en: They will make extensive offerings With incense, flowers, and ointments.

source: འཇིག་རྟེན་མགོན་པོ་དེ་ཡི་མཚན། །བརྗོད་པ་འཛིན་པར་མི་བྱེད་དེ། །བདུད་ཀྱི་ཕྱོགས་དང་སྔོན་ཀྱང་ནི། །མུ་སྟེགས་གྱུར་པ་མ་གཏོགས་སོ། །
en: “This does not include those who do not remember The name of this world protector when it is spoken, Or those who are on Māra ’s side, Or those who have previously been extremists.

source: ང་ཡིས་ཚུལ་འདི་བཤད་པ་ན། །སྔོན་ནི་གང་གིས་འདི་ཐོས་པ། །ཕྱི་མའི་དུས་ཀྱི་ཚེ་དག་ཏུ། །དེ་ཡི་ལག་ཏུ་མདོ་སྡེ་འཐོབ། །
en: “As I have taught this Dharma way, Those who have heard it now Shall also receive this discourse in their hands In a future life.

source: དེ་ཡིས་མདོ་སྡེ་དམ་པ་འདི། །བཤད་པ་དག་ནི་སུས་ཐོས་པ། །སྔོན་ནི་མཆོད་ཅིང་བཀུར་སྟི་བྱས། །དེ་ཡི་ལག་ཏུ་འདི་འཐོབ་བོ། །
en: “Those who hear the explanation Of this sublime discourse Have previously venerated and served, And they shall receive it in their hands again.

source: གང་གིས་སྨོན་ལམ་བཏབ་པ་ནི། །ཕྱི་མའི་དུས་ཀྱི་ཚེ་དག་ཏུ། །ཆོས་ཀྱི་རྒྱལ་པོས་གསུངས་པ་ཡི། །མདོ་འདི་ལག་ཏུ་འཐོབ་པར་འགྱུར། །
en: “Those who make aspirations Shall, in a future life, Receive into their hands This discourse spoken by the Dharma King.

source: གང་ཞིག་སེམས་ནི་རྩེ་གཅིག་གིས། །སངས་རྒྱས་གྲངས་མེད་བཀུར་སྟི་བས། །མདོ་འདི་ལ་ནི་གང་དད་པ། །དེ་བས་བསོད་ནམས་འདི་མང་འགྱུར། །
en: “Having faith in this discourse Brings even more merit Than honoring countless buddhas With a one-pointed mind.

source: རྟག་ཏུ་གཟུགས་བཟང་བསོད་ནམས་ལྡན། །
en: “They forever will have beautiful bodies and lots of merit [And be fearless and wealthy].

source: ཤིན་ཏུ་འཇིགས་མེད་ལོངས་སྤྱོད་ལྡན། །
en: They [forever[ will [have beautiful bodies and lots of merit And] be fearless and wealthy.

source: དྲན་དང་ལྡན་ཞིང་མཚན་རྣམས་ཀྱིས། །མངོན་པར་བརྒྱན་པ་དག་ཏུ་འགྱུར། །
en: They will be mindful And ornamented with the major marks.

source: དེ་ལྟ་བས་ན་མདོ་སྡེ་འདི། །ཐོས་ནས་ཕྱི་མའི་དུས་ཀྱི་ཚེ། །བཟུང་ཞིང་ཡང་དག་བསྟན་པ་དང་། །གཞན་དག་ལ་ཡང་བསྟན་པར་གྱིས། །
en: “Thus, having heard The teaching of this discourse, In the future retain it, teach it, And explain it to others!

source: གང་གིས་སངས་རྒྱས་འཁོར་ལོས་སྒྱུར། །འབུམ་ཕྲག་དག་ལ་བཀུར་བྱས་པས། །ཕྱི་མ་ཡི་ནི་དུས་དག་ཏུ། །དེས་མཐོང་བ་ལ་སོམ་ཉི་མེད། །
en: “Those who have honored hundreds of thousands Of buddhas, universal monarchs, Shall also in the future Have vision free from doubt.

source: གང་གིས་སྔོན་ནི་འཇིག་རྟེན་མགོན། །གྲངས་མེད་པ་ལ་བསྙེན་བཀུར་བས། །དེ་ཡི་འཇིག་རྟེན་མགོན་འདི་ཡི། །ཐོས་ཤིང་མཐོང་ལའང་ཡིད་ཆེས་སོ། །
en: “Those who have performed service For countless world protectors in the past Will trust what they hear and see Of this world protector.

source: གང་ཞིག་མཚན་འདི་ཐོས་ནས་སུ། །སངས་རྒྱས་ཀྱི་ནི་གཟུགས་བྱེད་པ། །དེ་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི། །བསྟན་པ་དང་ནི་དམ་ཆོས་བསྲུང་། །
en: “Those who hear his name Will actualize the form of a buddha. They will guard the teachings And the sublime Dharma of all the buddhas.

source: གང་ཞིག་བྱང་ཆུབ་བསྟན་སྤངས་ན། །བསྐལ་པ་བྱེ་བ་དག་ཏུ་ནི། །ལུག་ལྟར་ལྐུགས་ཤིང་མིག་ཉམས་ལ། །མིག་མེད་པ་དག་ཏུ་ཡང་འགྱུར། །
en: “However, those who abandon the teachings of awakening Shall become like sheep—mute and with poor eyesight, Or even with no eyes at all For millions of eons.

source: གང་ཞིག་ལག་པ་གཅིག་གིས་ནི། །མཆོད་རྟེན་གྲངས་མེད་བཤིག་བྱས་པས། །གང་གིས་མདོ་སྡེ་འདི་སྤངས་ན། །ཁྱད་ཆོས་སྡིག་པར་འདི་འགྱུར་རོ། །
en: “Compared to destroying countless caityas, With one’s own hands, It is a far viler deed To abandon this discourse.

source: དེ་ལྟ་བས་ན་ང་སྨྲ་བ། །ཕྱི་མའི་དུས་ཚེ་འདི་རྙེད་ནས། །སངས་རྒྱས་ཡེ་ཤེས་བླ་མེད་ལ། །སོམ་ཉི་ཟ་བར་མ་བྱེད་ཅིག །
en: “Thus when, at a future time, You attain that which I am preaching, Do not harbor any doubt About the unsurpassed wisdom of the buddhas.

source: མདོ་སྡེ་འདི་འདྲ་འདི་ཐོས་ནས། །མེ་ཏོག་སྤོས་དང་འཕན་རྣམས་དང་། །གདུགས་དང་ཕྱེ་མ་གོས་རྣམས་ཀྱིས། །གུས་པར་བྱས་ཏེ་མཆོད་པར་གྱིས། །
en: “Once you have heard this discourse, Perform respectful veneration With flowers, incense, streamers, Parasols, and powders!”

source: དེར་ནི་དེ་བཞིན་གཤེགས་པ་ཡི། །ཕྱག་མཉེན་ཤིན་ཏུ་འཇམ་པ་ཡིས། །ལིཙྪ་བཱི་ཡི་མགོ་བོ་ལ། །ཡང་དང་ཡང་དུ་བྱུག་པ་མཛད། །
en: Then, with his soft and supple hands, The Thus-Gone One Repeatedly caressed The Licchavi boy’s head.
